Revit 2025 API
TreadNosingPosition Enumeration
 Represents on which edges of the nosing to apply the nosing profile.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TreadNosingPosition
Public Enumeration TreadNosingPosition
public enum class TreadNosingPosition
type TreadNosingPosition
Members
Member name | Value | Description
FrontOnly | 0 |  Adds nosing on the front edge of tread only.
FrontAndLeft | 1 |  Adds nosing on the front and left edge of tread.
FrontAndRight | 2 |  Adds nosing on the front and right edge of tread.
FrontLeftAndRight | 3 |  Adds nosing on the front left and left edge of tread.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace